* GroupBy :- It is used to split data into groups based on some columns, then apply a function like sum(), mean(), count(), etc. & combine the result

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("raw_data.csv")
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [3]:
df.groupby("country")["income"].mean()

country
Canada    62000.0
China     51000.0
India     73000.0
Mexico    45000.0
Spain         NaN
USA       55400.0
Name: income, dtype: float64

In [4]:
df.groupby("country")["income"].max()

country
Canada    62000.0
China     51000.0
India     73000.0
Mexico    45000.0
Spain         NaN
USA       62000.0
Name: income, dtype: float64

In [5]:
df.groupby("country")["income"].min()

country
Canada    62000.0
China     51000.0
India     73000.0
Mexico    45000.0
Spain         NaN
USA       47000.0
Name: income, dtype: float64

In [6]:
df.groupby("gender")["income"].mean()

gender
Female     65666.666667
Male       54800.000000
Unknown    47000.000000
Name: income, dtype: float64

### Aggregation :-
* It help us to use statical (summery) function to groupby data
* It help us to use multiple function at one time

In [7]:
df.groupby("gender")["income"].agg(["min", "max", "mean"])

             min      max          mean
gender
Female   62000.0  73000.0  65666.666667
Male     45000.0  68000.0  54800.000000
Unknown  47000.0  47000.0  47000.000000

In [8]:
df["income"].agg(["min", "max", "mean"])

min     45000.0
max     73000.0
mean    57600.0
Name: income, dtype: float64

* We can assign the column name too while using aggrigation function

In [9]:
df.groupby("country")["income"].agg(min_salary="min", max_salary = "max", avg_Salary="mean")

         min_salary  max_salary  avg_Salary
country
Canada      62000.0     62000.0     62000.0
China       51000.0     51000.0     51000.0
India       73000.0     73000.0     73000.0
Mexico      45000.0     45000.0     45000.0
Spain           NaN         NaN         NaN
USA         47000.0     62000.0     55400.0

In [10]:
df.groupby("country").agg({
    "income" : "max",
    "age" : "mean"
})

          income   age
country
Canada   62000.0   NaN
China    51000.0  27.0
India    73000.0  45.0
Mexico   45000.0   NaN
Spain        NaN  34.0
USA      62000.0  29.5

In [ ]:
# label name change

df.groupby("country").agg(
    max_salary = ("income", "max"),
    avg_age = ("age", "mean")
)